app/views/users/show.html.erb

SELECT  1 AS one FROM "posts" WHERE "posts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
    <%= render 'follow_form' if logged_in? %>
    <% if @user.posts.any? %>