app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets" ORDER BY "pets"."created_at" DESC
---
  def index
    @pets = Pet.all

INSERT INTO "pets" ("name", "user_id", "created_at", "updated_at", "avatar") VALUES ('niania', 101, '2016-11-12 17:04:04.089555', '2016-11-12 17:04:04.089555', '6bb13d50gw1ezmmwutz65j21dl1dltgm.jpg') RETURNING "id"
---
  def create

    @pet = current_user.pets.build(pet_params)
    if @pet.save

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = 20 ORDER BY "pets"."created_at" DESC LIMIT 1
---
    def set_pet
      @pet = Pet.find(params[:id])