app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "hello"], ["user_id", 1], ["created_at", 2016-11-08 20:22:02 UTC], ["updated_at", 2016-11-08 20:22:02 UTC], ["picture", "6bb13d50gw1ezmmwutz65j21dl1dltgm.jpg"]]
---
  def create
  	@post = current_user.posts.build(post_params)
    if @post.save

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 305]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 305], ["LIMIT", 1]]
---
  def destroy
  	Post.find(params[:id]).destroy