app/controllers/static_pages_controller.rb

  def home
  	if logged_in?
  	    @post = current_user.posts.build
        @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT  "posts".* FROM "posts" WHERE (user_id IN (SELECT followed_id FROM relationships WHERE follower_id = 1) OR user_id = 1) ORDER BY "posts"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE (user_id IN ('SELECT followed FROM relationships WHERE follower_id = :user_id') OR user_id = 1)