app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @posts = @user.posts.paginate(page: params[:page])
    @pets = @user.pets.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2 OFFSET $3  [["user_id", 2], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 2]]
SELECT  "pets".* FROM "pets" WHERE "pets"."user_id" = 101 ORDER BY "pets"."created_at" DESC LIMIT 30 OFFSET 0

  def create
    @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"